<!DOCTYPE html>
<html>
    <head>
        <title>Installation von Oxygen, GitHub, Framework, Font</title>
        <style>
            p { font-size: 14pt; } 
        </style>
    </head>
    <body>
        <h1 style="margin-left: 0.4in; margin-top: 0.4in">Installationen f&uuml;r Hartmann von Aue &ndash; digital</h1>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>1.</b> Registrieren Sie sich bei <b>GitHub</b>. GitHub ist eine Plattform f&uuml;r Entwickler digitaler <i>tools</i>, die sich auf kollaborative Arbeit spezialisiert hat. Wir verwenden es als Cloud-Repository, das uns immer Zugriff auf die aktuellste Version der Dateien erm&ouml;glicht. Im Gegensatz zu anderen Cloud-Repositories m&uuml;ssen Sie zum Hochladen und Synchronisieren <i>immer</i>(!) den Befehl "fetch" oder "pull" geben. Gehen Sie zu <a href="https://github.com">GitHub</a> und registrieren Sie sich mit einer E-Mail-Adresse. Sie m&uuml;ssen einen Benutzernamen und ein Passwort erstellen. Schicken Sie mir bitten den Benutzernamen und die E-Mail-Adresse, damit ich Ihnen den Zugriff zu unserem Repositorium erteilen kann; Sie werden ihn f&uuml;r Punkt 7 ben&ouml;tigen.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>2.</b> Erstellen Sie einen Ordner auf Ihrem Computer, in dem Sie die Dateien dieses Projekts aufbewahren m&ouml;chten, z. B. <i>Gregorius</i>.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>3.</b> Downloaden und installieren Sie <a href="https://desktop.github.com">GitHub-Desktop</a>. Desktop ist eine kleine Konsole, mit der Sie die Dateien, die Sie von GitHub herunterladen und hochladen, einfach verwalten k&ouml;nnen. Es ist sehr einfach und n&uuml;tzlich.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>4.</b> Downloaden und installieren Sie die <a href="https://sourceforge.net/projects/junicode/files/">Junicode-Schriftart</a>. Junicode ist eine spezielle Schriftart f&uuml;r Medi&auml;visten und wird von uns f&uuml;r Transkriptionen verwendet. Sie k&ouml;nnen f&uuml;nf Schriftarten herunterladen: Junicode in 4 Modi (normal, kursiv, fett und kursiv-fett) sowie FoulisGreek. Letztere ist fakultativ, aber die anderen sind notwendig.</p>
        <p><br/></p>
        <p  style="margin-left: 0.4in"><b>5.</b> Downloaden und installieren Sie <a href="https://www.oxygenxml.com">Oxygen XML-Editor</a> herunterladen. Installieren Sie unbedingt die Version, f&uuml;r die wir ihnen den Lizenzschl&uuml;ssel geschickt haben. Sie werden bei der Installierung nach dem Lizenzschl&uuml;ssel gefragt und markieren die Option "Lizenzschl&uuml;ssel verwenden". Kopieren Sie ins Fenster den Lizenzschl&uuml;ssel (nur die 9 Zeilen zwischen "Start" und "Ende").</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>6.</b> Nun m&uuml;ssen Sie ein AddOn installieren, um das Framework von Gustavo Fern&aacute;ndez Riva nutzen zu k&ouml;nnen. Das Framework erm&ouml;glicht es Ihnen, im Author-Modus zu arbeiten, ohne die Codes zu sehen und mit einem speziellen Men&uuml; f&uuml;r unsere Kodierung.
        <p style="margin-left: 0.5in">a) Gehen Sie innerhalb von Oxygen zu: Help => Install new Add-ons . In das Fenster "Show new Add-ons from" kopieren Sie die folgende Adresse: <u>https://digi.ub.uni-heidelberg.de/frameworks/IweinFramework.xml</u>.</p>
        <p style="margin-left: 0.5in">b) Markieren Sie das heiEditions-Framework mit einem H&auml;kchen und folgen Sie allen Schritten zur Installation. Am Ende m&uuml;ssen Sie Oxygen schlie&szlig;en und erneut starten.</p></p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>7.</b> Nun sollten Sie  auch einige Einstellungen in Oxygen vornehmen: Gehen Sie im oberen Men&uuml; auf Options => Preferences</p>
        <p style="margin-left: 0.5in">a) Gehen Sie im linken Men&uuml; auf den Eintrag "Editor" und klicken Sie auf "Format". Im Eintrag "Line Width" stellen Sie die Zahl "10000" ein.</p>
        <p style="margin-left: 0.5in">b) Gehen Sie nun auf der linken Seite zum Untermen&uuml; "Format" und klicken Sie auf XML. Gehen Sie auf der rechten Seite auf den Abschnitt "Elements spacing". Klicken Sie auf den Reiter "Preserve Space", klicken Sie auf den Button "Add" unten und f&uuml;gen Sie "l//*" (ohne die Anf&uuml;hrungsstriche) hinzu.</p> 
        <p style="margin-left: 0.5in">c) Nun gehen Sie auf den Reiter "Mixed Content" und f&uuml;gen auf die gleiche Weise "l" hinzu (ein l wie Ludwig).</p>
        <p style="margin-left: 0.5in">d) Im Reiter "Line Break" f&uuml;gen Sie ebenfalls "l" hinzu.</p>
        <p style="margin-left: 0.5in">e) Klicken Sie auf Ok und schlie&szlig;en Sie.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>8.</b> Wenn ich Ihnen die Zugriffs Berechtigungen f&uuml;r GitHub erteilt habe (also an einem anderen Tag), gehen Sie auf GitHub Desktop und w&auml;hlen Sie "File" => "Clone repository".</p>
        <p style="margin-left: 0.5in">a) Im Fenster, das sich &ouml;ffnet, klicken Sie auf den Reiter URL;</p>
        <p style="margin-left: 0.5in">b) In "Repository URL" kopieren sie folgenden Link: <u>https://github.com/v-millet/Gregorius.git</u>.</p>
        <p style="margin-left: 0.5in">c) In "Local Path" klicken Sie auf "choose" und w&auml;hlen den Ordner auf ihrem Computer, den Sie oben in Punkt 2 eingerichtet haben.</p>
        <p style="margin-left: 0.5in">d) Nun klicken Sie auf "Clone" und alle Dateien und Ordner, die auf dem Repositorium liegen, werden auf ihren Computer kopiert.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>9.</b> Von diesem Moment an k&ouml;nnen Sie arbeiten. Wenn Sie &Auml;nderungen im Archiv vornehmen, kann ich sie sehen und korrigieren. Wenn ich &Auml;nderungen vornehme, werden sie Ihnen angezeigt.</p>
        <p><br/></p>
        <p style="margin-left: 0.4in"><b>10.</b> Folgende Arbeitsgewohnheit ist wichtig:</p> 
        <p style="margin-left: 0.5in">a) &Ouml;ffnen Sie vor der Arbeit <i>immer</i> Desktop, klicken Sie auf "Fetch" (und danach auf "Pull", wenn es etwas zu aktualisieren gibt). Erst dann &ouml;ffnen Sie ihre Datei.</p>
        <p style="margin-left: 0.5in">b) Wenn Sie fertig sind, speichern Sie die Datei auf Ihrem Computer und gehen Sie dann <i>immer</i> auf Desktop; Sie werden sehen, dass die Datei auf der linken Seite und die von Ihnen vorgenommenen &Auml;nderungen auf der rechten Seite erscheinen. Unten links unter "Summery" geben Sie ein, was Sie gemacht haben (z.B. "bis v. 123" oder "Abk&uuml;rzungen") und klicken dann auf "Commit" und dann oben rechts auf "Push". So aktualisieren Sie die Datei auf GitHub.</p>
        <p style="margin-left: 0.5in">c) Noch einmal: immer zwei Klicks, sowohl zum Herunterladen als auch zum Hochladen von Dateien.</p>
    </body>
</html>